In [1]:
import numpy as np
import pandas as pd

In [2]:
states_capital={'Karnataka':'Banglore','Andhra Pradesh':'Hyderabad','Tamil Nadu':'Chennai','Keral':'Thiruvananthpuram','Maharastra':'Mumbai'}
states_lang={'Karnataka':'kannada','Andhra Pradesh':'Telugu','Tamil Nadu':'Tamil','Keral':'Malyalam','Maharastra':'hindi'}

In [3]:
data=pd.DataFrame({'capitals':states_capital,'language':states_lang})
data

                         capitals  language
Karnataka                Banglore   kannada
Andhra Pradesh          Hyderabad    Telugu
Tamil Nadu                Chennai     Tamil
Keral           Thiruvananthpuram  Malyalam
Maharastra                 Mumbai     hindi

In [4]:
data['capitals'] is data.capitals

True

In [5]:
s_sub=pd.Series({'pruthvi':'kannada','pranam':'hindi','pratham':'english','pravaera':'maths'})
total_m=pd.Series({'pruthvi':60,'pranam':60,'pratham':50,'pravaera':40})
minf_m=pd.Series({'pruthvi':50,'pranam':50,'pratham':85,'pravaera':80})
obt_m=pd.Series({'pruthvi':10,'pranam':50,'pratham':60,'pravaera':40})

students=pd.DataFrame({'subjects':s_sub,'total_m':total_m,'minf_m':minf_m,'obt_m':obt_m})

students

         subjects  total_m  minf_m  obt_m
pruthvi   kannada       60      50     10
pranam      hindi       60      50     50
pratham   english       50      85     60
pravaera    maths       40      80     40

### Accessing the values

In [6]:
students.values[1]

array(['hindi', 60, 50, 50], dtype=object)

In [7]:
students.values[0:2]

array([['kannada', 60, 50, 10],
       ['hindi', 60, 50, 50]], dtype=object)

In [8]:
students['total_m']

pruthvi     60
pranam      60
pratham     50
pravaera    40
Name: total_m, dtype: int64

### Taking two values at a time use :

In [9]:
students['pranam':'pratham']

        subjects  total_m  minf_m  obt_m
pranam     hindi       60      50     50
pratham  english       50      85     60

In [10]:
students['pruthvi':'pranam']

        subjects  total_m  minf_m  obt_m
pruthvi  kannada       60      50     10
pranam     hindi       60      50     50

In [13]:
students.loc[students['total_m']>30,['obt_m','minf_m']]

          obt_m  minf_m
pruthvi      10      50
pranam       50      50
pratham      60      85
pravaera     40      80